function [Yv,Yr,Nv,Nr,Xvv,Xrr,Xvr,Yvv,Yvr,Yrr,Nvvr,Nvrr,Nrr] = hydroCoef(t)
Rou = 1000;
Pi = 3.14;
k = shipRatio(3000); %缩尺比
L = M10shipL_T(t)*k; %船长
B = L / M10shipLB_T(t); %船宽
T = B/M10shipBT_T(t); %吃水
Cb = M10shipCb_T(t); %方形系数
A = 2 * T / L ; %展弦比
M = L * B * T * Cb * Rou; %排水量
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
mx=1.0/100*(0.398+11.97*Cb*(1+3.73*T/B)-2.89*Cb*L/B*(1+1.13*T/B)+0.175*Cb*(L/B)*(L/B)*(1+0.541*T/B)-1.107*L/B*T/B)*M;          %X方向附加质量
my=(0.882-0.54*Cb*(1-1.6*T/B)-0.156*(1-0.673*Cb)*L/B+0.826*T/B*L/B*(1-0.678*T/B)-0.638*Cb*T/B*L/B*(1-0.669*T/B))*M;            %Y方向附加质量
Jzz=(1.0/100*(33-76.85*Cb*(1-0.784*Cb)+3.43*L/B*(1-0.63*Cb)))*(1.0/100*(33-76.85*Cb*(1-0.784*Cb)+3.43*L/B*(1-0.63*Cb)))*M*L*L; %Z方向附加质量

%%%%%%%%%井上模型%%%%%%%%%%%%%%%%%%
%%%%%%%%%线性水动力系数%%%%%%%%%%%%%
Yv=-(1.0/2*Pi*A+1.4*Cb*B/L);
Yr=(1.0/4*Pi*A);
Nv=-A;
Nr=(-0.54*A+A*A);
Yvv=(-0.048265+6.293*(1-Cb)*T/B);
Yvr=(0.3791-1.28*(1-Cb)*T/B);
Yrr=(0.0045-0.445*(1-Cb)*T/B);
Nvvr=(-6.0856+137.4735*(Cb*B/L)-1029.514*(Cb*B/L)^2+2480.6082*(Cb*B/L)^3);
Nvrr=(0.0635-0.04414*(Cb*T/B));
Nrr=(-0.0805+8.6092*(Cb*B/L)^2-36.9816*(Cb*B/L)^3);
	
Xvv=0.5*Rou*L*T*(0.4*B/L-0.006*L/T);
Xvr=(1.11*Cb-0.07)*0.5*my;
Xrr=0.5*Rou*L*L*L*T*(0.0003*L/T);