function [Nduo,Yduo] = Rudder(Fn,t)
%计算单位舵角(δ =1)引起的横向力Y和回转力矩N,这两个水动力导数又称为控制导数。
Rou = 1000;
Pi = 3.14;
g = 9.8;
lmd = 1;
Ad = 6.25;
n = 2; %每秒转速
D = 2.5; %螺旋桨直径(m)
P = 1; %螺距比
duoj = 1;
H = 2.5;
k = shipRatio(3000); %缩尺比
L = shipL_T(t) * k; %船长
CII = 4.8;
Cb = shipCb_T(t); %方形系数
u = Fn * (g*L)^0.5 * 0.515;
wp0 = 0.55*Cb+0.20; %伴流分数
Jp = u * (1-wp0)/n * D;%进速系数
s0 = 1.0 - u * (1.0 - wp0)/(n * P); %直航滑脱比
s = 1.0 - u * Jp * D / P;%操纵中得滑脱比
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
wR = 0.25;
y = D/H;
K = 0.6*(1-wp0)/(1-wR);
G = y * K * (2-(2-K)*s)*s/((1-s)*(1-s));
%%%%%%%%%%%%%%%%%%%%%%%计算ur%%%%%%%%%%%%%%%%%%%%%%%%%%
k22 = 0.935 ;
ur = (1 - wR)* (1 + k22 * G)^0.5 * u;
%%%%%%%%%%%%%%%%%%%%%%%计算ar%%%%%%%%%%%%%%%%%%%%%%%%%%
duojiao0 = Pi * s0 / 90;
ar = duoj + duojiao0;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
aH0=0.6784-1.3374*Cb+1.8891*Cb^2;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
xr = - L/2;
TR=0.2618 + 0.0539 * Cb - 0.1755 * Cb * Cb;
Fnlr=1.0/2*(6.13*lmd/(lmd+2.25))*Ad*ur*ur*sin(ar)*Rou;
Fnrr=1.0/2*(6.13*lmd/(lmd+2.25))*Ad*ur*ur*sin(ar)*Rou;
Yduo=-(1+aH0)*(Fnlr+Fnrr)*cos(duoj);
Nduo=-(1+0.9*aH0)*xr*(Fnlr+Fnrr)*cos(duoj)-(1.0-TR)*(CII/2)*((Fnlr-Fnrr))*sin(duoj);